package com.ktdsuniversity.edu.errorhandle.assignment;

/*
자판기는 상품을 판매합니다.
상품은 "번호", "이름", "가격", "재고 수", "소비 기한" 을 가지고 있습니다. "번호"는 상품을 구분하기 위한 것으로 정수형 타입입니다.
"이름"은 상품의 이름으로 문자열 타입입니다. "가격"은 상품의 가격으로 정수형 타입입니다.
"재고 수"는 상품의 재고 수로 정수형 타입입니다. "소비 기한"은 상품의 소비 기한까지 남은 날의 수이며 정수형 타입입니다.
예컨데, 상품(3, "스탠리", 15000, 3, 3) 이라는 상품 인스턴스는
상품 번호 3번의 스탠리 제품의 가격은 15000원이며 재고는 3개 남았고 소비 기한은 앞으로 3일 남은 제품입니다.
고객이 소비 기한이 0보다 큰 상품을 구매 성공하면 자판기의 돈 보관함에 상품의 가격만큼 추가되며 판매한 상품의 재고 수는 1개가 줄어듭니다.
또한, 고객이 넣은 돈보다 더 저렴한 상품을 구매했다면 남은 거스름돈을 고객에게 돌려주어야 합니다.
자판기의 돈 보관함에 상품 가격만큼 추가되고 재고 수가 1개가 줄어드는 것은 거래가 완료되었을 때 이루어집니다.
만약 소비 기한이 0 미만이라면 판매할 수 없습니다.
예컨데, 고객이 상품을 구매하기 위해 돈을 넣은 후 소비 기한이 0 미만인 상품을 구매하려 할 때
고객에게 "죄송합니다. 소비 기한이 지난 상품입니다." 라고 알려주며 돈을 다시 돌려주어야 합니다.
배열, 데이터 클래스, 예외 처리, try-catch, throw 를 이용해 자판기 프로그램을 만들어보세요.
*/
/*
---메인
--기능
-main(String[] args)
*/

public class Main {
	
	public static void main(String[] args) {
		
	}

}

//		try {
//			
//		}
//		catch () {
//			
//		}