package com.ktdsuniversity.edu.staticexam.assignment;

/*
 음료와 주류를 파는 바입니다.
 음료 혹은 주류를 고객에게 팔면 바는 돈을 법니다.
 음료와 주류는 개수의 제한이 없습니다.
 음료 가격과 주류 가격은 다릅니다.
 음료 가격과 주류 가격은 절대 바뀔 수 없으며, 고객이 가격을 알고 있어야 합니다. - static 이용
 19세 미만의 고객에게는 주류는 팔 수 없습니다.
 고객이 음료 혹은 주류를 구매할 돈이 없다면 구매할 수 없습니다.
 주류를 마실 경우 취한 정도가 0.5씩 오릅니다.
 음료를 마실 경우 배부른 정도가 0.2씩 오릅니다.
 고객이 잔뜩 취했거나 배가 매우 부를 때엔 고객의 돈이 충분하더라도 더 이상 판매하지 않습니다.
 고객의 취한 정도가 10 이상이면 잔뜩 취했다라고 가정합니다. - static 메소드 이용
 고객의 배부른 정도가 20 이상이면 더 이상 먹을 수 없다라고 가정합니다. - static 메소드 이용
 */

public class Bar {
	

}
